---
kind: method
id: M:Autodesk.Revit.DB.TableMergedCell.Dispose
source: html/6c5b9174-8275-7340-4080-aa55a3edacc9.htm
---
# Autodesk.Revit.DB.TableMergedCell.Dispose Method

Releases all resources used by the TableMergedCell

## Syntax (C#)
```csharp
public void Dispose()
```